// blog = https://blog.0patch.com/2022/06/microsoft-diagnostic-tools-dogwalk.html
// some FPs if people download legit .diagcab files from websites

DeviceProcessEvents| where ProcessCommandLine contains @"msdt.exe"
| where ProcessCommandLine contains "/cab"
| where ProcessCommandLine contains ".diagcab"
